; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-45)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b4)
    (on b4 b7)
    (on b7 b13)
    (on-table b13)
    (clear b5)
    (on b5 b8)
    (on b8 b11)
    (on-table b11)
    (clear b12)
    (on b12 b9)
    (on b9 b6)
    (on b6 b3)
    (on b3 b10)
    (on b10 b2)
    (on-table b2))
 (:goal (and 
(on-table b12)
(clear b6) (on-table b6)
(on b1 b12)
(on b7 b1)
(on b5 b7)
(on b9 b5)
(on b3 b9)
(on b10 b3)
(on b2 b10)
(on b13 b2)
(on b8 b13)
(on b11 b8)
))
)

; plan
1. (unstack b12 b9)
   deleted: (on b12 b9) (clear b12) (arm-empty)
   added: (holding b12) (clear b9)
   goals met: 0 of 13
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 1 of 13
3. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 1 of 13
4. (stack b1 b12)
   deleted: (clear b12) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b12)
   goals met: 2 of 13
5. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 2 of 13
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 13
7. (unstack b7 b13)
   deleted: (on b7 b13) (clear b7) (arm-empty)
   added: (holding b7) (clear b13)
   goals met: 2 of 13
8. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 3 of 13
9. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 3 of 13
10. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 4 of 13
11. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 5 of 13
12. (stack b9 b5)
   deleted: (clear b5) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b5)
   goals met: 6 of 13
13. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 5 of 13
14. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 7 of 13
15. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 7 of 13
16. (stack b3 b9)
   deleted: (clear b9) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b9)
   goals met: 8 of 13
17. (unstack b10 b2)
   deleted: (on b10 b2) (clear b10) (arm-empty)
   added: (holding b10) (clear b2)
   goals met: 8 of 13
18. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 9 of 13
19. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 13
20. (stack b2 b10)
   deleted: (clear b10) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b10)
   goals met: 10 of 13
21. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 10 of 13
22. (stack b13 b2)
   deleted: (clear b2) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b2)
   goals met: 11 of 13
23. (unstack b8 b11)
   deleted: (on b8 b11) (clear b8) (arm-empty)
   added: (holding b8) (clear b11)
   goals met: 11 of 13
24. (stack b8 b13)
   deleted: (clear b13) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b13)
   goals met: 12 of 13
25. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 12 of 13
26. (stack b11 b8)
   deleted: (clear b8) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b8)
   goals met: 13 of 13
